DUTIES_CONFIG = {}

DUTIES_CONFIG.default_map = "rp_anaxes_defcon_v2"

-- Точка в оружейной комнате (здесь получают и сдают оружие)
DUTIES_CONFIG.armory_point = Vector(-7814.6328125, 6722.5185546875, -6090.96875)

-- Оружие, которое выдается в начале и забирается после патруля
DUTIES_CONFIG.weapon = "masita_dc15le"

----------------------------------------------------------------
-- ПАТРУЛЬ -----------------------------------------------------
----------------------------------------------------------------

-- Награда за патруль (деньги)
DUTIES_CONFIG.patrol_award_money = 100

-- Награда за патруль (опыт)
DUTIES_CONFIG.patrol_award_exp = 1

-- Сколько нужно пройти точек для выполнения
DUTIES_CONFIG.patrol_num_points = 6

-- Время ожидания на каждой точке
DUTIES_CONFIG.patrol_wait = 8

-- Необходимое расстояние от точки до бойца
DUTIES_CONFIG.patrol_point_dist = 150

-- Максимальное количество патрульных
DUTIES_CONFIG.max_patrol_units = 10

DUTIES_CONFIG.patrol_points = {
    Vector(-8219.2109375, 8113.1235351562, 54.031234741211),
    Vector(-6551.5439453125, 8842.4267578125, 54.031238555908),
    Vector(-5118.2407226562, 8310.76171875, 54.03125),
    Vector(-7820.525390625, 9881.287109375, 49.03125),
    Vector(-7574.1459960938, 10549.291992188, 17.03125),
    Vector(-7574.2915039062, 12158.35546875, 17.03125),
    Vector(-8228.1748046875, 12164.340820312, 17.031257629395),
    Vector(-8224.080078125, 10546.376953125, 17.031242370605),
    Vector(-6427.5102539062, 10889.573242188, 49.03125),
    Vector(-5094.5444335938, 10888.73828125, 49.03125),
    Vector(-4249.1123046875, 11232.834960938, 49.03125),
    Vector(-4874.798828125, 11833.891601562, 49.03125),
    Vector(-5645.4340820312, 11824.85546875, 49.03125),
    Vector(-5711.7939453125, 13219.090820312, 49.03125),
    Vector(-6646.8623046875, 11828.395507812, 49.03125),
    Vector(-9075.68359375, 11821.836914062, 49.03125),
    Vector(-9985.783203125, 12172.069335938, 49.03125),
    Vector(-11536.41796875, 11810.834960938, 49.03125),
    Vector(-11527.888671875, 10876.942382812, 49.03125),
    Vector(-10023.96875, 10893.036132812, 49.03125),
    Vector(-8104.4912109375, 10243.086914062, 529.03125),
    Vector(-7277.138671875, 10222.862304688, 529.03125),
    Vector(-7220.2924804688, 10965.657226562, 529.03125),
    Vector(-7228.4306640625, 11868.489257812, 529.03125),
    Vector(-7344.6528320312, 12513.642578125, 529.03125),
    Vector(-8573.830078125, 12447.7734375, 529.03125),
} 

----------------------------------------------------------------
-- ПОСТЫ -------------------------------------------------------
----------------------------------------------------------------

-- Награда за пост (деньги)
DUTIES_CONFIG.station_award_money = 350

-- Награда за пост (опыт)
DUTIES_CONFIG.station_award_exp = 1

-- Время дежурства на посту (в секундах)
DUTIES_CONFIG.station_wait = 400

-- Допустимое время отсутствия на посту
DUTIES_CONFIG.station_leave_time = 30
-- Допустимое время на получение оружия, на выбор поста, на сдачу оружия
DUTIES_CONFIG.station_equip_time = 180

DUTIES_CONFIG.station_points = {
    Vector(-8180.3647460938, 6761.25, 241.03125),
    Vector(-5735.95703125, 13216.923828125, 49.031234741211),
    Vector(-13063.680664062, 8141.7290039062, 49.03125),
    Vector(-13042.737304688, 8409.84765625, 49.03125),
    Vector(-9245.9296875, 1298.2507324219, 153.03126525879),
    Vector(-10765.170898438, 1292.2337646484, 153.03125),
    Vector(-8744.36328125, 1129.8549804688, 625.03125),
    Vector(-8897.5078125, 1097.6888427734, 625.03125),
    Vector(-6954.3046875, -5196.982421875, 625.03125),
    Vector(-7134.6748046875, -5209.7021484375, 625.03125),
    Vector(-8738.9111328125, -5211.5239257812, 625.03125),
    Vector(-8905.52734375, -5227.7729492188, 625.03125),
    Vector(-7471.9189453125, -5125.6987304688, 49.03125),
}

----------------------------------------------------------------
-- ЛОГИСТИКА ---------------------------------------------------
----------------------------------------------------------------

-- Награда за 1 ящик (деньги)
DUTIES_CONFIG.logistics_award_money = 200

-- Награда за 1 ящик (опыт)
DUTIES_CONFIG.logistics_award_exp = 10

DUTIES_CONFIG.logistics_minimum = 1

DUTIES_CONFIG.storage_points = {
    Vector(-5144.7177734375, -1072.2204589844, 88.031242370605),
    Vector(-5268.8940429688, -1077.4678955078, 88.031242370605),
}

DUTIES_CONFIG.drop_points = {
    Vector(-5144.7177734375, -1072.2204589844, 88.031242370605),
    Vector(-5268.8940429688, -1077.4678955078, 88.031242370605),
    Vector(-7813.9008789062, 6714.150390625, 256.03125),
    Vector(-3840.5146484375, 8921.8603515625, 64.03125),
    Vector(-7476.1704101562, 7695.3544921875, 608.03125),
    Vector(-8400.0546875, 14476.944335938, 544.03125),
    Vector(-8392.6669921875, 13444.369140625, 544.03125),
    Vector(-7413.8046875, 14449.637695312, 544.03125),
}

DUTY_NONE = 0

DUTY_PATROL_PREPARING = 11 -- Получение оружия
DUTY_PATROL = 12 -- Активная фаза патруля
DUTY_PATROL_FINISH = 13 -- сдача оружия

DUTY_STATION_PREPARING = 21 -- Получение/сдача оружия
DUTY_STATION_CHOOSING = 22 -- Выбор точки поста
DUTY_STATION = 23 -- Активная фаза (стоит на посту)
DUTY_STATION_FINISH = 24 -- Закончил пост

DUTY_LOGISTICS = 31
DUTY_LOGISTICS_CARRY = 32

-- LANG
DUTY_STATUS_TEXTS = {}
DUTY_STATUS_TEXTS[DUTY_PATROL_PREPARING] = "Получение оружия"
DUTY_STATUS_TEXTS[DUTY_PATROL] = "В патруле"
DUTY_STATUS_TEXTS[DUTY_PATROL_FINISH] = "Сдача оружия"
DUTY_STATUS_TEXTS[DUTY_STATION_PREPARING] = "Получение оружия"
DUTY_STATUS_TEXTS[DUTY_STATION_CHOOSING] = "Выбор поста"
DUTY_STATUS_TEXTS[DUTY_STATION] = "Дежурство на посту"
DUTY_STATUS_TEXTS[DUTY_STATION_FINISH] = "Сдача оружия"
DUTY_STATUS_TEXTS[DUTY_LOGISTICS] = "Получение груза"
DUTY_STATUS_TEXTS[DUTY_LOGISTICS_CARRY] = "Переноска груза"